"""Завдання. 
Розв'язати за допомогою купи.

Є декілька мережевих кабелів різної довжини, їх потрібно об'єднати по два за раз в один кабель, 
використовуючи з'єднувачі, у порядку, який призведе до найменших витрат. 
Витрати на з'єднання двох кабелів дорівнюють їхній сумі довжин, 
а загальні витрати дорівнюють сумі з'єднання всіх кабелів.
Завдання полягає в тому, щоб знайти порядок об'єднання, 
який мінімізує загальні витрати."""
import heapq

def optimize(arr: list) -> list:
    """Функція для знаходження порядку об'єднання елементів, який мінімізує загальні витрати"""
    optimal_spendings = []
    while arr:
        cable = heapq.heappop(arr)
        cable1 = heapq.heappop(arr)
        sums = cable + cable1
        heapq.heappush(optimal_spendings, sums)
    return optimal_spendings


cables = [5, 10, 13, 13, 16, 22, 17, 17, 8, 30]

print(optimize(cables))





